## Test import-open-tofu
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to import, 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           RESOURCE                            |
|--------|---------------------------------------------------------------|
| import | `aws_cloudwatch_log_group.controltower-notificationforwarder` |
|        | `aws_sns_topic.controltower-notificationforwarder`            |
| add    | `aws_cloudwatch_log_group.topic`                              |
| update | `aws_sns_topic.controltower-notificationforwarder`            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # aws_cloudwatch_log_group.controltower-notificationforwarder will be imported
    resource "aws_cloudwatch_log_group" "controltower-notificationforwarder" {
        arn               = "arn:aws:logs:ca-central-1:124044056575:log-group:/aws/lambda/aws-controltower-NotificationForwarder"
        id                = "/aws/lambda/aws-controltower-NotificationForwarder"
        log_group_class   = "STANDARD"
        name              = "/aws/lambda/aws-controltower-NotificationForwarder"
        retention_in_days = 14
        skip_destroy      = false
        tags              = {}
        tags_all          = {}
    }

  # aws_cloudwatch_log_group.topic will be created
  + resource "aws_cloudwatch_log_group" "topic" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "topic"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_sns_topic.controltower-notificationforwarder will be updated in-place
  # (imported from "arn:aws:sns:ca-central-1:124044056575:internal-sre-alert")
  ~ resource "aws_sns_topic" "controltower-notificationforwarder" {
        application_success_feedback_sample_rate = 0
        arn                                      = "arn:aws:sns:ca-central-1:124044056575:internal-sre-alert"
        content_based_deduplication              = false
        fifo_topic                               = false
        firehose_success_feedback_sample_rate    = 0
        http_success_feedback_sample_rate        = 0
        id                                       = "arn:aws:sns:ca-central-1:124044056575:internal-sre-alert"
      - kms_master_key_id                        = "155aaa0e-75b8-485b-886f-ec2cdd98fb92" -> null
        lambda_success_feedback_sample_rate      = 0
        name                                     = "internal-sre-alert"
        owner                                    = "124044056575"
        policy                                   = jsonencode(
            {
                Id        = "SNS Access Policy"
                Statement = [
                    {
                        Action    = [
                            "SNS:Subscribe",
                            "SNS:SetTopicAttributes",
                            "SNS:RemovePermission",
                            "SNS:Receive",
                            "SNS:Publish",
                            "SNS:ListSubscriptionsByTopic",
                            "SNS:GetTopicAttributes",
                            "SNS:AddPermission",
                        ]
                        Condition = {
                            StringEquals = {
                                "aws:SourceOwner" = "124044056575"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "arn:aws:sns:ca-central-1:124044056575:internal-sre-alert"
                        Sid       = "AllowAccountToUse"
                    },
                    {
                        Action    = "SNS:Publish"
                        Condition = {
                            StringEquals = {
                                "aws:SourceAccount" = "124044056575"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            Service = "cloudwatch.amazonaws.com"
                        }
                        Resource  = "arn:aws:sns:ca-central-1:124044056575:internal-sre-alert"
                        Sid       = "AllowCloudWatchToPublish"
                    },
                    {
                        Action    = "SNS:Publish"
                        Condition = {
                            ArnEquals = {
                                "aws:SourceArn" = "arn:aws:events:ca-central-1:124044056575:rule/internal-sre-alerts-abuse-rule"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            Service = "events.amazonaws.com"
                        }
                        Resource  = "arn:aws:sns:ca-central-1:124044056575:internal-sre-alert"
                        Sid       = "AllowAbuseEventsToPublish"
                    },
                    {
                        Action    = "SNS:Publish"
                        Condition = {
                            StringEquals = {
                                "aws:SourceAccount" = "124044056575"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            Service = "budgets.amazonaws.com"
                        }
                        Resource  = "arn:aws:sns:ca-central-1:124044056575:internal-sre-alert"
                        Sid       = "AllowBudgetEventsToPublish"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        signature_version                        = 0
        sqs_success_feedback_sample_rate         = 0
        tags                                     = {
            "CostCentre" = "SRE"
            "Terraform"  = "true"
            "managed_by" = "AFT"
        }
        tags_all                                 = {
            "CostCentre" = "SRE"
            "Terraform"  = "true"
            "managed_by" = "AFT"
        }
    }

Plan: 2 to import, 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.controltower-notificationforwarder"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.topic"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
